/=#

#langdef   en-US "English"

#string STR_DRAMD_FORM                      #language en-US "DRAM Configuration"
#string STR_DRAMD_FORM_HELP                      #language en-US "DRAM Debug Form"
#string STR_CURRENT_CPUBUS_FREQ_STRING               #language en-US "Current CPUBUS Frequency"
#string STR_CURRENT_CPUBUS_FREQ_VALUE                #language en-US "N/A"
#string STR_DRAM_CURRENT_FREQ_STRING               #language en-US "Current DRAM Frequency"
#string STR_DRAM_CURRENT_FREQ_VALUE                #language en-US "N/A"

#string STR_DRAMCLK                      #language en-US "DRAM Clock"
#string STR_EMPTY                      #language en-US " "
#string STR_BY_SPD                      #language en-US "By SPD"
#string STR_400M                      #language en-US "400 Mhz"
#string STR_466M                      #language en-US "466 Mhz"
#string STR_533M                      #language en-US "533 Mhz"
#string STR_600M                      #language en-US "600 Mhz"
#string STR_667M                      #language en-US "667 Mhz"
#string STR_733M                      #language en-US "733 Mhz"
#string STR_800M                      #language en-US "800 Mhz"
#string STR_866M                      #language en-US "866 Mhz"
#string STR_933M                      #language en-US "933 Mhz"
#string STR_1000M                      #language en-US "1000 Mhz"
#string STR_1066M                      #language en-US "1066 Mhz"
#string STR_1133M                      #language en-US "1133 Mhz"
#string STR_1200M                      #language en-US "1200 Mhz"
#string STR_1333M                      #language en-US "1333 Mhz"
#string STR_1400M                      #language en-US "1400 Mhz"
#string STR_1466M                      #language en-US "1466 Mhz"
#string STR_1600M                      #language en-US "1600 Mhz"

#string STR_RESERVED                     #language en-US "Reserved"
#string STR_BANK_INTER                      #language en-US "Mulitpage Control"
#string STR_SPD                      #language en-US "SPD"
#string STR_NON_PAGE                      #language en-US "non-page"

#string STR_RXIO_TIMING_METHOD                      #language en-US "Rx IO Timing Method (TNI/DQSI)"
#string STR_DQSI_BY_RANK                      #language en-US "Set DQSI by Rank"

#string STR_TXIO_TIMING_METHOD                      #language en-US "Tx IO Timing Method (DQSO/DQO)"
#string STR_SI_SI                      #language en-US "SI/SI"
#string STR_READLEV_SI                      #language en-US "Read Leveling/SI"
#string STR_SI_READLEV                      #language en-US "SI/Read Leveling"
#string STR_3D_SCAN                      #language en-US "3D SCAN"
#string STR_DQSI_READPREAMBLE                      #language en-US "DQSI READPREAMBLE"
#string STR_READLEV_READLEV                      #language en-US "Read Leveling/Read Leveling"
#string STR_WRITELEV_LCU                      #language en-US "Write Leveling/LCU"
#string STR_LCU_LCU                      #language en-US "LCU/LCU"
#string STR_HARDCODEWLVL_LCU             #language en-US "Hardcode Write Leveling/LCU"



#string STR_2_PAGE                     #language en-US "2 pages"
#string STR_4_PAGE                      #language en-US "4 pages"
#string STR_8_PAGE                      #language en-US "8 pages"
#string STR_MEMCHIP_ODT                      #language en-US "Memory Chip ODT RttNom"
#string STR_MEMCHIP_ODTWRDEBUG                      #language en-US "Memory Chip ODT RttWr"
#string STR_AUTO                      #language en-US "Auto"
#string STR_DISABLE                     #language en-US "Dsiable"

#string STR_20_OHM                      #language en-US "20 ohm"
#string STR_30_OHM                      #language en-US "30 ohm"
#string STR_34_OHM                      #language en-US "34 ohm"
#string STR_40_OHM                      #language en-US "40 ohm"
#string STR_48_OHM                      #language en-US "48 ohm"
#string STR_60_OHM                      #language en-US "60 ohm"
#string STR_80_OHM                      #language en-US "80 ohm"
#string STR_120_OHM                      #language en-US "120 ohm"
#string STR_240_OHM                      #language en-US "240 ohm"

#string STR_MEMCHIP_ODTPARK_DEBUG                      #language en-US "Memory Chip ODT RttPark"


#string STR_VRANK_INTER                      #language en-US "Channel Rank Interleave"
#string STR_RANK_INTERLV_ONLY                #language en-US "Channel Rank interleave auto"
#string STR_DISABLED                      #language en-US "Disabled"
#string STR_CHANNEL_INTER                      #language en-US "Channel Rank Interleave"
#string STR_CHANNEL_INTERLV_ONLY                #language en-US "channel interleave auto"

#string STR_CH_DECODE                      #language en-US "Select Channel Decode"
#string STR_DECODE_A8A9                      #language en-US "A8^A9"
#string STR_DECODE_A8A9A12A13A18A19      #language en-US "A8A9A12A13A18A19"

#string STR_BANK_GROUP_BIT0_DECODE      #language en-US "Bank Group Bit0 Decode"
#string STR_BG_DECODE_A7_A14            #language en-US "Bank Group Bit0 Decode Using A7^A14"
#string STR_BG_DECODE_A6_A14            #language en-US "Bank Group Bit0 Decode Using A6^A14"

#string STR_RA0_SEL                      #language en-US "Rank Interleave Address Bit 0(RA0) Select"
#string STR_A15                      #language en-US "A15"
#string STR_A17                      #language en-US "A17"
#string STR_A19                      #language en-US "A19"
#string STR_A21                      #language en-US "A21"
#string STR_RA1_SEL                      #language en-US "Rank Interleave Address Bit 1(RA1) Select"
#string STR_A14                      #language en-US "A14"
#string STR_A16                      #language en-US "A16"
#string STR_A18                      #language en-US "A18"
#string STR_A20                      #language en-US "A20"
#string STR_BA_SEL                   #language en-US "DDR4 BA Select"

#string STR_CRC_PAR_RETRY_EN                      #language en-US "CRCParRetryEn"
#string STR_PAR_ERR_CTRL                      #language en-US "ParErrControl"
#string STR_CRC_ERROR_CTRL                      #language en-US "CRCErrControl"
#string STR_ECC_RETRY                      #language en-US "EccRetry"
#string STRECC_PATROL_SCRUB                      #language en-US "EccPatrolScrub"
#string STR_ENABLED                      #language en-US "Eabled"
#string STR_SLOWEST                      #language en-US "Slowest"
#string STR_DEFAULT                      #language en-US "Default"

#string STR_RFW2W                      #language en-US "RFW2W"
#string STR_RFR2R                      #language en-US "RFR2R"
#string STR_RFR2W                      #language en-US "RFR2W"
#string STR_RDFW2R                      #language en-US "RDFW2R"

#string STR_DATA_SCMB                      #language en-US "Data Scramble"
#string STR_DQM_PINOUT                      #language en-US "Data Mask Pin Out"
#string STR_REQUEST_INORDER                      #language en-US "Request Inorder"
#string STR_32_WIDTH                      #language en-US "DRAM 32-bit data width"
#string STR_SWAP_BYTE7_BYTE8                      #language en-US "Swap Byte7 And Byte8"
#string STR_SWAP_CHANNELA_CHANNELB                      #language en-US "Swap Channel A And Channel B"
#string STR_SCAN_IO_TIMING                      #language en-US "Scan Dram Timing"
#string STR_DRAM_ECC                      #language en-US "ECC function"
#string STR_ECC_CLEAR_MEM                      #language en-US "Clear Memory"
#string STR_XMP                      #language en-US "XMP Support"
#string STR_SEL_PROFILE1                      #language en-US "Profile 1"
#string STR_SEL_PROFILE2                      #language en-US "Profile 2"
#string STR_VDD_SEL                      #language en-US "VDD Select"
#string STR_VDD_0_9                      #language en-US "0.9V"
#string STR_VDD_1                      #language en-US "1.0V"
#string STR_BL                      #language en-US "Burst Length"
#string STR_BL8                      #language en-US "BL8"
#string STR_ON_FLY                      #language en-US "Bust Chop On-The-Fly"
#string STR_CMD_RATE                      #language en-US "1TCmdRate"
#string STR_2T                      #language en-US "2T"
#string STR_1T                      #language en-US "1T"
#string STR_VGA_SHAREMEM                      #language en-US "VGA Share Memory"
#string STR_64M       #language en-US "64MB"
#string STR_128M       #language en-US "128MB"
#string STR_256M       #language en-US "256MB"
#string STR_512M       #language en-US "512MB"
#string STR_1024M       #language en-US "1024MB"
#string STR_2048M       #language en-US "2048MB"
#string STR_SOFT_FORCE       #language en-US "Force Software"
#string STR_DISABLE       #language en-US "Disable"
#string STR_ENABLE       #language en-US "Enable"
#string STR_INIT_METHOD       #language en-US "Dram init Method "
#string STR_PSELF_REFRESH       #language en-US "DRAM Self Refresh"
#string STR_AUTO                      #language en-US "Auto"

#string STR_DYNAMIC_CKE       #language en-US "Dynamic CKE"
//#string STR_BYBANK_DYNAMIC_CKE       #language en-US "By Rank Dynamic CKE"
#string STR_REMAP_FUNC       #language en-US "Remap Function"
#string STR_LIMIT_RANK_SIZE       #language en-US "Limit Rank Size"

#string STR_TOTAL_MEMORY_NAME       #language en-US "Total Memory"
#string STR_TOTAL_MEMORY_VALUE       #language en-US "N/A"

#string STR_MEMORY_SLOT0_NAME       #language en-US "Memory Slot0"
#string STR_MEMORY_SLOT0_VALUE       #language en-US "N/A"

#string STR_MEMORY_SLOT1_NAME       #language en-US "Memory Slot1"
#string STR_MEMORY_SLOT1_VALUE       #language en-US "N/A"

#string STR_MEMORY_SLOT2_NAME       #language en-US "Memory Slot2"
#string STR_MEMORY_SLOT2_VALUE       #language en-US "N/A"

#string STR_MEMORY_SLOT3_NAME       #language en-US "Memory Slot3"
#string STR_MEMORY_SLOT3_VALUE       #language en-US "N/A"
#string STR_MEM_INFO       #language en-US "Memory Information"
#string STR_DRAM_CONFIG       #language en-US "DRAM Configuration"
#string STR_DQSI_ADJUST_EN       #language en-US "DQSI Adjust Control"


#string STR_DRAM_ASPDI       #language en-US "Advanced SPD info"
#string STR_INFO1       #language en-US "Info1"
#string STR_INFO2       #language en-US "Info2"



#string STR_DRAM_FAST_BOOT_CTRL       #language en-US "Dram Fast Boot Control"
#string STR_DRAM_FAST_BOOT       #language en-US "Dram Fast Boot"
#string STR_DRAM_RXTXTIMING_HARDCODE #language en-US "Dram RxTx Timing HardCode"
#string STR_DRAM_CRCEN       #language en-US "CRC Enable"

#string STR_DRAM_CAPAR_EN       #language en-US "CAPar Enable"
#string STR_DRAM_CAPAR_PER_EN       #language en-US "CAParPer Enable"
#string STR_DRAM_WPREA       #language en-US "WPREA"
#string STR_WPREA1CLK       #language en-US "WPREA1CLK"
#string STR_WPREA2CLK       #language en-US "WPREA2CLK"
#string STR_DRAM_RPREA       #language en-US "RPREA"
#string STR_RPREA1CLK       #language en-US "RPREA1CLK"
#string STR_RPREA2CLK       #language en-US "RPREA2CLK"
#string STR_DRAM_CALEN       #language en-US "CALEn"
#string STR_ACTIMING_OPTION       #language en-US "ACTimingOption"
#string STR_ACTIMING_AUTO       #language en-US "ACTIMING_AUTO"
#string STR_ACTIMING_MANUAL       #language en-US "ACTIMING_MANUAL"
//IVES-20180517 Add Dram voltage control.
#string STR_VOLTAGE_CONTROL    #language en-US "DRAM_VOLTAGE_CONTROL"
#string STR_VOLTAGE_0    #language en-US "Voltage + 2%"
#string STR_VOLTAGE_1    #language en-US "Voltage + 4%"
#string STR_VOLTAGE_2    #language en-US "Voltage + 6%"
#string STR_VOLTAGE_3    #language en-US "Voltage - 2%"
#string STR_VOLTAGE_4    #language en-US "Voltage - 4%"
#string STR_VOLTAGE_5    #language en-US "Voltage - 6%"
#string STR_DRAM_CL       #language en-US "DramCL"
#string STR_DRAM_TRCD       #language en-US "DramTrcd"
#string STR_DRAM_TRP       #language en-US "DramTrp"
#string STR_DRAM_TRAS       #language en-US "DramTras"
#string STR_AC_TIMING_OPTION                      #language en-US "AC Timing Option"
#string STR_DRAMCL                      #language en-US "CAS Latency"
#string STR_DRAMCL_HELP                      #language en-US "CAS Latency Valid Range(9-21)"
#string STR_DRAMTRP                      #language en-US "TRP"
#string STR_DRAMTRP_HELP                      #language en-US "TRP Valid Range(4-20)"
#string STR_DRAMTRCD                      #language en-US "TRCD"
#string STR_DRAMTRCD_HELP                      #language en-US "TRCD Valid Range(4-20)"
#string STR_DRAMTRAS                      #language en-US "TRAS"
#string STR_DRAMTRAS_HELP                      #language en-US "TRAS Valid Range(15-46)"
#string STR_DRAM_CL_VALUE                     #language en-US "N/A"
#string STR_DRAMTRP_VALUE                     #language en-US "N/A
#string STR_DRAMTRCD_VALUE                     #language en-US "N/A
#string STR_DRAMTRAS_VALUE                     #language en-US "N/A"
#string STR_04                      #language en-US "4"
#string STR_05                      #language en-US "5"
#string STR_06                      #language en-US "6"
#string STR_07                      #language en-US "7"
#string STR_08                      #language en-US "8"
#string STR_09                      #language en-US "9"
#string STR_010                      #language en-US "10"
#string STR_011                      #language en-US "11"

#string STR_015                      #language en-US "15"
#string STR_016                      #language en-US "16"
#string STR_017                      #language en-US "17"
#string STR_018                      #language en-US "18"
#string STR_019                      #language en-US "19"
#string STR_020                      #language en-US "20"
#string STR_021                      #language en-US "21"
#string STR_022                      #language en-US "22"
#string STR_023                      #language en-US "23"
#string STR_024                      #language en-US "24"
#string STR_025                      #language en-US "25"
#string STR_026                      #language en-US "26"
#string STR_027                      #language en-US "27"
#string STR_028                      #language en-US "28"
#string STR_029                      #language en-US "29"
#string STR_030                      #language en-US "30"

#string STR_502                      #language en-US "502"
#string STR_515                      #language en-US "515"
#string STR_528                      #language en-US "528"
#string STR_541                      #language en-US "541"
#string STR_554                      #language en-US "554"
#string STR_567                      #language en-US "567"
#string STR_580                      #language en-US "580"
#string STR_593                      #language en-US "593"
#string STR_600                      #language en-US "600"
#string STR_613                      #language en-US "613"
#string STR_626                      #language en-US "626"
#string STR_639                      #language en-US "639"
#string STR_652                      #language en-US "652"
#string STR_665                      #language en-US "665"
#string STR_678                      #language en-US "678"
#string STR_691                      #language en-US "691"
#string STR_704                      #language en-US "704"
#string STR_717                      #language en-US "717"
#string STR_730                      #language en-US "730"
#string STR_743                      #language en-US "743"
#string STR_756                      #language en-US "756"
#string STR_769                      #language en-US "769"
#string STR_782                      #language en-US "782"
#string STR_795                      #language en-US "795"
#string STR_808                      #language en-US "808"
#string STR_821                      #language en-US "821"
#string STR_834                      #language en-US "834"
#string STR_847                      #language en-US "847"
#string STR_860                      #language en-US "860"

#string STR_TXVREF       #language en-US "TxVref"
#string STR_CAL        #language en-US "TxVref Calibration"
#string STR_RXVERF       #language en-US "RxVref"
#string STR_RXVERF_HELP        #language en-US "RxVref Calibration"
#string STR_TXVREF_ALLBYTE        #language en-US "TxVref Calibration All Byte"

#string STR_TURN_AROUND_PERFORMANCE #language en-US "Optimize Turn Around For Performance"
#string STR_TXVREF_DDRCOMP          #language en-US "TXVREF_DDRCOMP"
#string STR_DRAM_CONSOLE          #language en-US "DRAM DEBUG CONSOLE"

#string STR_SI                      #language en-US "SI"
#string STR_CAL_BY_RANK                      #language en-US "CAL_BY_RANK"
#string STR_CAL_BY_CHANNEL                     #language en-US "CAL_BY_CHANNEL"
#string STR_RRANK_RDELAY                 #language en-US "STR_RRANK_RDELAY"
#string STR_RRANK_RDELAY_HELP                 #language en-US "STR_RRANK_RDELAY_HELP"
#string STR_RRANK_WDELAY                 #language en-US "STR_RRANK_WDELAY"
#string STR_RRANK_WDELAY_HELP                 #language en-US "STR_RRANK_WDELAY_HELP"
#string STR_DQS_TNI_SETTING                 #language en-US "DQS TNI"
#string STR_TNI_HIGH_PULSE                 #language en-US "TNI High Pulse"
#string STR_TNI_LOW_PULSE                 #language en-US "TNI Low Pulse"
#string STR_DRAM_TEMP_DETECT_PROMPT		#language en-US "Memory Temperature Detect Function"
#string STR_DRAM_TEMP_DETECT_HELP		#language en-US "Memory Temperature Detect and Display"
#string STR_DRAM_TEMP_ASSERT_PROMPT		#language en-US "Critical Temperature Assert"
#string STR_DRAM_TEMP_ASSERT_HELP		#language en-US "Critical Temperature Assert EVENT Function Control"
#string STR_DRAM_TEMP_VALUE_PROMPT		#language en-US "Critical Temperature Value"
#string STR_DRAM_TEMP_VALUE_HELP		#language en-US "Set Critical Temperature Value in C (0~255)"
#string STR_DRAM_REDUCE_RATE_PROMPT		#language en-US "Dram Reduce Rate"
#string STR_DRAM_REDUCE_RATE_HELP		#language en-US "Set Dram Reduce Rate (0~127) (2/(n+3)*100%)"